local _, ns = ...
local _, C = unpack(ns)

-- 法术白名单
C.WhiteList = {
	-- 自定义
	[ 450047] = true, -- 千丝之城，啃噬

	-- 大秘境
	[ 226510] = true, -- 血池
	[ 228318] = true, -- 激怒
	[ 343502] = true, -- 鼓舞光环
	[ 343553] = true, -- 万噬之怨
	-- Dungeons
	[ 113315] = true, -- 青龙寺，强烈
	[ 113309] = true, -- 青龙寺，至高能量
	[ 384148] = true, -- 诱捕陷阱，蕨皮
	[ 200672] = true, -- 水晶迸裂，巢穴
	[ 377724] = true, -- 小怪易伤，提尔
	[ 413027] = true, -- 泰坦之壁，永恒黎明
	[ 258653] = true, -- 魂能壁垒，阿塔达萨
	[ 255960] = true, -- 强效巫毒，阿塔达萨
	[ 255967] = true, -- 强效巫毒，阿塔达萨
	[ 255968] = true, -- 强效巫毒，阿塔达萨
	[ 255970] = true, -- 强效巫毒，阿塔达萨
	[ 255972] = true, -- 强效巫毒，阿塔达萨
	[ 260805] = true, -- 聚焦之虹，庄园
	[ 264027] = true, -- 结界蜡烛，庄园
	[ 372824] = true, -- 燃烧锁链，奈萨鲁斯
	-- TWW S1
	[ 343558] = true, -- 通灵战潮，病态凝视
	[ 343470] = true, -- 通灵战潮，碎骨之盾
	[ 328351] = true, -- 通灵战潮，染血长枪
	[ 323149] = true, -- 仙林，黑暗之拥
	[ 322569] = true, -- 仙林，兹洛斯之手
	-- TWW S2
	[ 293724] = true, -- 车间，护盾发生器
	[ 320293] = true, -- 伤逝剧场，融入死亡
	[ 331510] = true, -- 伤逝剧场，死亡之愿
	[ 333241] = true, -- 伤逝剧场，暴脾气
}

-- 法术黑名单
C.BlackList = {
}

-- 特殊单位的染色列表
C.CustomUnits = {
	[ 225977] = true, -- 地下城训练假人

	[ 162245] = true, -- 腐化的折磨者
	[ 162247] = true, -- 腐化的狱卒
	[ 162248] = true, -- 腐化的守护者
	[ 162251] = true, -- 腐化的召唤师
	[ 162290] = true, -- 腐化的觅血鲨
	-- 地下堡
	[ 234900] = true, -- 幽坑太保的铁杆粉丝
	[ 234901] = true, -- 幽坑太保的亲密好友
	[ 234902] = true, -- 幽坑太保的劲爆盟友
	[ 234904] = true, -- 幽坑太保的见习保镖
	[ 234905] = true, -- 凶狠的走失大地精
	-- 大秘境
	[  40633] = true, -- 潮汐王座，纳兹夏尔荣誉守卫
	[  40925] = true, -- 潮汐王座，污染哨兵
	[  41096] = true, -- 潮汐王座，纳兹夏尔神谕者
	[  44404] = true, -- 潮汐王座，纳兹夏尔冰霜女巫
	[  81819] = true, -- 永茂林地，永茂博学者
	[  84400] = true, -- 永茂林地，多瘤古树
	[  84957] = true, -- 永茂林地，腐烂的炎术士
	[  95771] = true, -- 黑心林地，恐魂毁灭者
	[  98280] = true, -- 黑鸦堡垒，复活的奥术师
	[  98368] = true, -- 黑鸦堡垒，幽灵卫兵
	[  98810] = true, -- 黑鸦堡垒，愤怒卫士剑圣
	[  99359] = true, -- 黑心林地，腐心守护者
	[  99366] = true, -- 黑心林地，污心召唤师
	[ 102095] = true, -- 黑鸦堡垒，复活的长枪兵
	[ 102788] = true, -- 黑鸦堡垒，魔怨支配者
	[ 122969] = true, -- 阿塔达萨，赞枢利巫医
	[ 122972] = true, -- 阿塔达萨，达萨莱占卜师
	[ 122973] = true, -- 阿塔达萨，达萨莱神官
	[ 128434] = true, -- 阿塔达萨，飨宴的啸天龙
	[ 129367] = true, -- 围攻伯拉勒斯，水鼠帮唤风者
	[ 129370] = true, -- 围攻伯拉勒斯，铁潮塑浪者
	[ 129372] = true, -- 围攻伯拉勒斯，黑油投弹者
	[ 130661] = true, -- 暴富矿区，风险投资公司塑地者
	[ 131586] = true, -- 庄园，宴会招待员
	[ 131587] = true, -- 庄园，着魔的队长
	[ 131685] = true, -- 庄园，符文信徒
	[ 131812] = true, -- 庄园，毒心诱魂者
	[ 133432] = true, -- 暴富矿区，风险投资公司炼金师
	[ 135263] = true, -- 围攻伯拉勒斯，艾什凡观察员
	[ 136470] = true, -- 暴富矿区，零食商贩
	[ 136549] = true, -- 围攻伯拉勒斯，艾什凡炮手
	[ 137029] = true, -- 暴富矿区，军械专家
	[ 138255] = true, -- 围攻伯拉勒斯，艾什凡观察员
	[ 144071] = true, -- 围攻伯拉勒斯，铁潮塑浪者
	[ 144295] = true, -- 麦卡贡-车间，麦卡贡机械师
	[ 160495] = true, -- 伤势剧场，狂热的缚魂者
	[ 163618] = true, -- 通灵战潮，佐尔拉姆斯通灵师
	[ 164510] = true, -- 伤势剧场，蹒跚的弩手
	[ 164562] = true, -- 赎罪大厅，堕落的驯犬者
	[ 164921] = true, -- 塞兹仙林的迷雾，德鲁斯特收割者
	[ 165251] = true, -- 塞兹仙林的迷雾，幻影仙狐
	[ 165872] = true, -- 通灵战潮，血肉工匠
	[ 166299] = true, -- 塞兹仙林的迷雾，纱雾照看者
	[ 166302] = true, -- 通灵战潮，尸体收割者
	[ 167111] = true, -- 塞兹仙林的迷雾，锥喉鹿角巨虫
	[ 174210] = true, -- 伤势剧场，凋零淤泥喷射者
	[ 199748] = true, -- 永恒黎明，时间线掠夺者
	[ 201223] = true, -- 永恒黎明，永恒暮光大法师
	[ 203799] = true, -- 永恒黎明，部落掷斧者
	[ 205384] = true, -- 永恒黎明，永恒治历者
	[ 205804] = true, -- 永恒黎明，复生的巨龙
	[ 206064] = true, -- 永恒黎明，凝结时刻
	[ 206070] = true, -- 永恒黎明，克罗纳克西
	[ 206352] = true, -- 永恒黎明，联盟弓箭手
	[ 206697] = true, -- 圣焰隐修院，虔诚的牧师
	[ 207186] = true, -- 驭雷栖巢，任性的雷鸫
	[ 208456] = true, -- 暗焰裂口，残步恐魔
	[ 208698] = true, -- 永恒黎明，永恒裂隙法师
	[ 210812] = true, -- 暗焰裂口，皇家点芯者
	[ 212453] = true, -- 矶石宝库，阴森的虚空之魂
	[ 213338] = true, -- 矶石宝库，炉铸愈疗者
	[ 213806] = true, -- 潮汐王座，秽斑
	[ 213893] = true, -- 破晨号，夜幕暗法师
	[ 214350] = true, -- 矶石宝库，被转化的代言人
	[ 214439] = true, -- 驭雷栖巢，被腐化的先知
	[ 214673] = true, -- 燧酿酒庄，风味科学家
	[ 214920] = true, -- 燧酿酒庄，品酒间侍从
	[ 216293] = true, -- 回响之城，颤声侍从
	[ 216339] = true, -- 千丝之城，苏雷吉反自然者
	[ 220141] = true, -- 燧酿酒庄，蜂王浆供应商
	[ 220195] = true, -- 千丝之城，苏雷吉缚丝者
	[ 220815] = true, -- 暗焰裂口，炽焰魔
	[ 222964] = true, -- 燧酿酒庄，风味科学家
	[ 223253] = true, -- 回响之城，沾血的网法师
	[ 223844] = true, -- 千丝之城，隐秘网士
	[ 224219] = true, -- 格瑞姆巴托，暮光唤地者
	[ 224276] = true, -- 格瑞姆巴托，暮光执行者
	[ 224732] = true, -- 千丝之城，隐秘网士
	[ 224962] = true, -- 矶石宝库，咒炉愈疗者
	[ 229212] = true, -- 水闸行动，暗索爆破手
	[ 229686] = true, -- 水闸行动，风险投资公司勘探员
	[ 231385] = true, -- 水闸行动，暗索调查员
	[ 236033] = true, -- 麦卡贡-车间，金属粘泥
	[ 242209] = true, -- 生态园顶，吃撑的幼虫

}

-- 显示能量值的单位
C.PowerUnits = {
	[  56792] = true, -- 青龙寺，怀疑臆象
	[ 114247] = true, -- 卡上，馆长
	[ 163746] = true, -- 垃圾场，步行震击者X1型
	[ 165556] = true, -- 赤红深渊，瞬息具象
	[ 171557] = true, -- 猎手阿尔迪莫，巴加斯特之影
	[ 219301] = true, -- 燧酿酒庄，酒滴
}

-- 无效目标
C.TrashUnits = {
	-- 特殊词缀
	[ 174773] = true, -- 怨毒影魔
	[ 204560] = true, -- 虚体生物
	-- 大秘境
	[  98677] = true, -- 黑鸦堡垒，鸦堡小蜘蛛
	[ 100991] = true, -- 黑心林地，纠缠之根
	[ 169875] = true, -- 伤势剧场，桎梏之魂
	[ 210270] = true, -- 燧酿酒庄，酒滴
	[ 218865] = true, -- 燧酿酒庄，小蜜蜂
	[ 224853] = true, -- 格瑞姆巴托，变异幼崽
}

-- 危险目标
C.WarningUnits = {
	[ 225976] = true, -- 普通坦克假人

	-- 大秘境
	[ 133430] = true, -- 暴富矿区，风险投资公司策划
	[ 134012] = true, -- 暴富矿区，监工阿斯加里
	[ 134232] = true, -- 暴富矿区，雇来的刺客
	[ 136643] = true, -- 暴富矿区，艾泽里特提取器
	[ 137029] = true, -- 暴富矿区，军械专家
	[ 144293] = true, -- 麦卡贡-车间，废料处理单位
	[ 144294] = true, -- 麦卡贡-车间，麦卡贡工匠
	[ 151657] = true, -- 麦卡贡-车间，炸弹坦克
	[ 164506] = true, -- 伤势剧场，上古队长
	[ 167607] = true, -- 赎罪大厅，石裔切割者
	[ 167876] = true, -- 赎罪大厅，审判官西加尔
	[ 170690] = true, -- 伤势剧场，染病恐魔
	[ 170850] = true, -- 伤势剧场，狂怒的血角
	[ 170882] = true, -- 伤势剧场，白骨魔导师
	[ 208450] = true, -- 暗焰裂口，漫游蜡烛
	[ 209801] = true, -- 驭雷栖巢，军需官科拉泰特
	[ 210269] = true, -- 燧酿酒庄，雇佣的打手
	[ 210539] = true, -- 暗焰裂口，通道爬行者
	[ 211121] = true, -- 暗焰裂口，职阶监督者
	[ 212786] = true, -- 驭雷栖巢，驭虚者
	[ 212793] = true, -- 驭雷栖巢，虚空晋升者
	[ 212826] = true, -- 圣焰隐修院，守卫队长苏雷曼
	[ 212827] = true, -- 圣焰隐修院，高阶牧师艾姆雅
	[ 212831] = true, -- 圣焰隐修院，铸炉大师达米安
	[ 214421] = true, -- 驭雷栖巢，凝虚散播者
	[ 214697] = true, -- 燧酿酒庄，主厨丘伊
	[ 216340] = true, -- 回响之城，哨兵鹿壳虫
	[ 216364] = true, -- 回响之城，鲜血监督者
	[ 217658] = true, -- 圣焰隐修院，布朗派克爵士
	[ 220946] = true, -- 燧酿酒庄，风险投资公司蜂蜜收割者
	[ 221760] = true, -- 圣焰隐修院，亡灵法师
	[ 223423] = true, -- 燧酿酒庄，粗心的酒花大地精
	[ 229251] = true, -- 水闸行动，风险投资公司建筑师
	[ 230740] = true, -- 水闸行动，撕碎王3000型
	[ 230748] = true, -- 水闸行动，暗索扭血者
	[ 231312] = true, -- 水闸行动，风险投资公司电工
	[ 239833] = true, -- 圣焰隐修院，艾蕾娜·安博兰兹
	[ 239834] = true, -- 圣焰隐修院，泰纳·杜尔玛
	[ 239836] = true, -- 圣焰隐修院，歇尼麦尔中士

}

-- 显示姓名板单位的目标
C.ShowTargetNPCs = {
	--[ 165251] = true, -- 仙林狐狸
	[  40357] = true, -- 格瑞姆巴托火元素
	[ 133482] = true, -- 蛛形地雷
	[ 164702] = true, -- 食腐蛆虫
	[ 174773] = true, -- 怨毒影魔
}

-- 重要读条高亮
C.MajorSpells = {
	[ 156718] = true, -- 骨疽爆裂，影月墓地
	[ 156776] = true, -- 虚空撕裂，影月墓地
	[ 398150] = true, -- 统御，影月墓地
	[ 398206] = true, -- 死亡冲击，影月墓地
	[ 152964] = true, -- 虚空脉冲，影月墓地
	[ 198595] = true, -- 雷霆飞弹，英灵殿
	[ 396812] = true, -- 秘法冲击，学院
	[ 397889] = true, -- 海潮爆发，青龙寺
	[ 395859] = true, -- 游荡尖啸，青龙寺
	[ 397878] = true, -- 魔化涟漪，青龙寺
	[ 392451] = true, -- 闪火，红玉
	[ 392452] = true, -- 闪火，红玉
	[ 385536] = true, -- 烈焰之舞，红玉
	[ 372087] = true, -- 炽焰冲刺，红玉
	[ 372735] = true, -- 大地裂击，红玉
	[ 388283] = true, -- 喷发，阻击战
	[ 387440] = true, -- 亵渎咆哮，阻击战
	[ 386012] = true, -- 风暴之箭，阻击战
	[ 374720] = true, -- 吞噬践踏，碧蓝
	[ 372222] = true, -- 奥术顺劈，碧蓝
	[ 386546] = true, -- 清醒的克星，碧蓝
	[ 387564] = true, -- 秘法蒸汽，碧蓝
	-- S2
	[  88186] = true, -- 雾气形态，旋云之巅
	[  87779] = true, -- 强效治疗术，旋云之巅
	[  87761] = true, -- 鼓舞，旋云之巅
	[  87762] = true, -- 闪电鞭笞，旋云之巅
	[  87618] = true, -- 静电缠握，旋云之巅
	[ 413385] = true, -- 过载接地场，旋云之巅
	[ 411001] = true, -- 致命电流，旋云之巅
	[ 410870] = true, -- 旋风，旋云之巅
	[ 411012] = true, -- 寒冷吐息，旋云之巅
	[ 388424] = true, -- 风暴狂怒，注能大厅
	[ 391634] = true, -- 极寒冰冻，注能大厅
	[ 377341] = true, -- 浪潮分裂，注能大厅
	[ 374699] = true, -- 灸灼，注能大厅
	[ 376171] = true, -- 舒心海潮，注能大厅
	[ 374563] = true, -- 眩晕，注能大厅
	[ 388886] = true, -- 紊流，注能大厅
	[ 374339] = true, -- 挫志怒吼，注能大厅
	[ 374045] = true, -- 驱逐，注能大厅
	[ 376171] = true, -- 舒心海潮，注能大厅
	[ 265091] = true, -- 戈霍恩之赐，地渊
	[ 369811] = true, -- 残暴猛击，奥达曼
	[ 369675] = true, -- 闪电链，奥达曼
	[ 369573] = true, -- 沉重之箭，奥达曼
	[ 369411] = true, -- 音速爆裂，奥达曼
	[ 369409] = true, -- 顺劈斩，奥达曼
	[ 369465] = true, -- 石雹，奥达曼
	[ 369466] = true, -- 石雹，奥达曼
	[ 369563] = true, -- 狂野顺劈，奥达曼
	[ 226296] = true, -- 穿刺碎片，巢穴
	[ 202075] = true, -- 灼烧，巢穴
	[ 193585] = true, -- 束缚，巢穴
	[ 257397] = true, -- 治疗药膏，自由镇
	[ 257426] = true, -- 反手猛击，自由镇
	[ 257732] = true, -- 震耳咆哮，自由镇
	[ 258777] = true, -- 海流喷射，自由镇
	[ 257784] = true, -- 冰霜冲击，自由镇
	[ 257736] = true, -- 风啸雷鸣，自由镇
	[ 257737] = true, -- 风啸雷鸣，自由镇
	[ 257899] = true, -- 痛苦的激励，自由镇
	[ 265019] = true, -- 顺劈斩，地渊
	[ 278961] = true, -- 衰落意志，地渊
	[ 260894] = true, -- 蔓延腐化，地渊
	[ 265540] = true, -- 腐化胆汁，地渊
	[ 265542] = true, -- 腐化胆汁，地渊
	[ 265089] = true, -- 黑暗复苏，地渊
	[ 278755] = true, -- 哀嚎绝望，地渊
	[ 266106] = true, -- 音速尖啸，地渊
	[ 272609] = true, -- 疯狂凝视，地渊
	[ 265433] = true, -- 枯萎诅咒，地渊
	[ 382410] = true, -- 枯萎之箭，蕨皮
	[ 367500] = true, -- 狰狞蔑笑，蕨皮
	[ 382555] = true, -- 狂怒风暴，蕨皮
	[ 382556] = true, -- 狂怒风暴，蕨皮
	[ 377950] = true, -- 强效治疗湍流，蕨皮
	[ 381470] = true, -- 妖诡图腾，蕨皮
	[ 381694] = true, -- 腐朽感官，蕨皮
	[ 388060] = true, -- 恶臭吐息，蕨皮
	[ 383385] = true, -- 腐烂激涌，蕨皮
	[ 383385] = true, -- 腐爆图腾，蕨皮
	[ 382712] = true, -- 死疽吐息，蕨皮
	[ 384899] = true, -- 骨箭雨，蕨皮
	[ 378282] = true, -- 熔火之心，奈萨鲁斯
	[ 383651] = true, -- 熔火军团，奈萨鲁斯
	[ 375439] = true, -- 炽然冲锋，奈萨鲁斯
	[ 395427] = true, -- 燃烧咆哮，奈萨鲁斯
	[ 376186] = true, -- 迸发挤压，奈萨鲁斯
	[ 372223] = true, -- 愈合泥土，奈萨鲁斯
	[ 373424] = true, -- 束地之矛，奈萨鲁斯
	[ 376780] = true, -- 岩浆护盾，奈萨鲁斯
	-- S3
	[ 411994] = true, -- 时光融蚀，永恒黎明
	[ 418200] = true, -- 永恒燃烧，永恒黎明
	[ 411300] = true, -- 咸鱼箭雨，永恒黎明
	[ 413607] = true, -- 侵蚀齐射，永恒黎明
	[ 417011] = true, -- 圣光术，永恒黎明
	[ 169179] = true, -- 巨灵猛击，永茂林地
	-- TWW S1
	[  76711] = true, -- 灼烧心智，格瑞姆巴托
	[ 451871] = true, -- 剧烈震颤，格瑞姆巴托
	[ 256957] = true, -- 防水甲壳，围攻伯拉勒斯
	[ 275826] = true, -- 强化怒吼，围攻伯拉勒斯
	[ 322938] = true, -- 收割精魂，塞茲仙林的迷雾
	[ 324776] = true, -- 木棘外壳，塞茲仙林的迷雾
	[ 326046] = true, -- 模拟抗性，塞茲仙林的迷雾
	[ 340544] = true, -- 再生鼓舞，塞茲仙林的迷雾
	[ 321828] = true, -- 肉饼蛋糕，塞茲仙林的迷雾
	[ 340160] = true, -- 辐光之息，塞茲仙林的迷雾
	[ 324293] = true, -- 刺耳尖啸，通灵战潮
	[ 338357] = true, -- 暴捶，通灵战潮
	[ 320596] = true, -- 深重呕吐，通灵战潮
	[ 327130] = true, -- 修复血肉，通灵战潮
	[ 328667] = true, -- 寒冰箭雨，通灵战潮
	[ 334749] = true, -- 排干体液，通灵战潮
	[ 335143] = true, -- 接骨，通灵战潮
	[ 338353] = true, -- 瘀液喷撒，通灵战潮
	[ 433841] = true, -- 毒液箭雨，回响之城
	[ 434793] = true, -- 共振弹幕，回响之城
	[ 434802] = true, -- 惊惧尖鸣，回响之城
	[ 448248] = true, -- 恶臭齐射，回响之城
	[ 443430] = true, -- 流丝缠缚，千丝之城
	[ 446086] = true, -- 虚空之波，千丝之城
	[ 452162] = true, -- 愈合之网，千丝之城
	[ 432520] = true, -- 暗影屏障，破晨号
	[ 450756] = true, -- 深渊嗥叫，破晨号
	[ 451097] = true, -- 流丝护壳，破晨号
	[ 429109] = true, -- 愈合金属，矶石宝库
	[ 429545] = true, -- 噤声齿轮，矶石宝库
	[ 445207] = true, -- 穿透哀嚎，矶石宝库
	[ 449455] = true, -- 咆哮恐惧，矶石宝库
	-- TWW s2
	[ 437721] = true, -- 沸燃烈焰，燧酿酒庄
	[ 440687] = true, -- 蜂蜜齐射，燧酿酒庄
	[ 441242] = true, -- 免费样品？，燧酿酒庄
	[ 441351] = true, -- 狂蜂怒火，燧酿酒庄
	[ 441627] = true, -- 疗愈蜂蜜，燧酿酒庄
	[ 422541] = true, -- 吸取光明，暗焰裂口
	[ 424322] = true, -- 爆炸烈焰，暗焰裂口
	[ 425536] = true, -- 鼹鼠狂暴，暗焰裂口
	[ 426295] = true, -- 烈焰系链，暗焰裂口
	[ 424420] = true, -- 余烬冲击，圣焰隐修院
	[ 427356] = true, -- 强效治疗术，圣焰隐修院
	[ 444743] = true, -- 连珠火球，圣焰隐修院
	[ 427260] = true, -- 闪电涌动，驭雷栖巢
	[ 427616] = true, -- 能量弹幕，驭雷栖巢
	[ 462771] = true, -- 勘测光束，水闸行动
	[ 463058] = true, -- 嗜血狞笑，水闸行动
	[ 468631] = true, -- 鱼叉，水闸行动
	[ 471733] = true, -- 回春水藻，水闸行动
	[1214468] = true, -- 特技射击，水闸行动
	[ 330562] = true, -- 挫志怒吼，伤逝剧场
	[ 341977] = true, -- 血肉之盾，伤逝剧场
	[ 342675] = true, -- 骨矛，伤逝剧场
	[ 263202] = true, -- 石枪，暴富矿区！！
	[ 263215] = true, -- 地壳屏障，暴富矿区！！
	[ 268702] = true, -- 狂怒地震，暴富矿区！！
	[ 268797] = true, -- 转化：敌人变黏液，暴富矿区！！
	[ 269302] = true, -- 淬毒之刃，暴富矿区！！
	[ 280604] = true, -- 冰镇汽水，暴富矿区！！
	[ 293729] = true, -- 调校，麦卡贡-车间
	[ 293827] = true, -- 超荷冲击波，麦卡贡-车间
	[ 301088] = true, -- 引爆，麦卡贡-车间
	[ 294324] = true, -- 车间，超级电钻
	[ 297128] = true, -- 车间，短路
	[ 291613] = true, -- 车间，发射升空
	[ 293861] = true, -- 车间，反步兵松鼠
	[ 341969] = true, -- 伤势剧场，凋零释放
	[ 330586] = true, -- 伤势剧场，吞噬血肉
	[ 333294] = true, -- 伤势剧场，死亡之风
	[ 330868] = true, -- 伤势剧场，通灵箭雨
}